/**
 * @file 公招tag
 */

interface TagsItem {
    tags: string[],
    operators: string[],
}

export type Tags = TagsItem []

const tag = [
    "新手", "资深干员", "高级资深干员", "远程位", "近战位",
    "先锋干员", "狙击干员", "医疗干员", "术师干员",
    "近卫干员", "重装干员", "辅助干员", "特种干员", "治疗",
    "支援", "输出", "群攻", "减速", "生存", "防护", "削弱",
    "位移", "控场", "爆发", "召唤", "快速复活", "费用回复",
    "支援机械",]

const tags6:Tags = [
    {
        tags: ['高级资深干员'],
        operators: ['所有的公招六星干员'],
    }
]

const tags5:Tags = [
    {
        "tags": [
            "资深干员"
        ],
        "operators": [
            "所有的公招五星干员"
        ]
    },
    {
        "tags": [
            "控场"
        ],
        "operators": [
            "格劳克斯",
            "红",
            "德克萨斯",
            "梅尔"
        ]
    },
    {
        "tags": [
            "召唤"
        ],
        "operators": [
            "梅尔"
        ]
    },
    {
        "tags": [
            "防护",
            "位移"
        ],
        "operators": [
            "可颂"
        ]
    },
    {
        "tags": [
            "重装干员",
            "输出"
        ],
        "operators": [
            "火神",
            "雷蛇"
        ]
    },
    {
        "tags": [
            "重装干员",
            "生存"
        ],
        "operators": [
            "火神"
        ]
    },
    {
        "tags": [
            "重装干员",
            "位移"
        ],
        "operators": [
            "可颂"
        ]
    },
    {
        "tags": [
            "远程位",
            "爆发"
        ],
        "operators": [
            "守林人"
        ]
    },
    {
        "tags": [
            "近战位",
            "削弱"
        ],
        "operators": [
            "槐琥"
        ]
    },
    {
        "tags": [
            "近卫干员",
            "防护"
        ],
        "operators": [
            "星极"
        ]
    },
    {
        "tags": [
            "输出",
            "防护"
        ],
        "operators": [
            "星极",
            "火神",
            "雷蛇"
        ]
    },
    {
        "tags": [
            "输出",
            "位移"
        ],
        "operators": [
            "崖心"
        ]
    },
    {
        "tags": [
            "辅助干员",
            "输出"
        ],
        "operators": [
            "真理"
        ]
    },
    {
        "tags": [
            "辅助干员",
            "削弱"
        ],
        "operators": [
            "巫恋",
            "初雪"
        ]
    },
    {
        "tags": [
            "群攻",
            "削弱"
        ],
        "operators": [
            "陨星",
            "慑砂"
        ]
    },
    {
        "tags": [
            "生存",
            "防护"
        ],
        "operators": [
            "火神"
        ]
    },
    {
        "tags": [
            "狙击干员",
            "爆发"
        ],
        "operators": [
            "守林人"
        ]
    },
    {
        "tags": [
            "特种干员",
            "输出"
        ],
        "operators": [
            "狮蝎",
            "崖心"
        ]
    },
    {
        "tags": [
            "特种干员",
            "生存"
        ],
        "operators": [
            "狮蝎"
        ]
    },
    {
        "tags": [
            "特种干员",
            "削弱"
        ],
        "operators": [
            "槐琥"
        ]
    },
    {
        "tags": [
            "特种干员",
            "减速"
        ],
        "operators": [
            "食铁兽"
        ]
    },
    {
        "tags": [
            "治疗",
            "输出"
        ],
        "operators": [
            "夜魔"
        ]
    },
    {
        "tags": [
            "治疗",
            "减速"
        ],
        "operators": [
            "夜魔"
        ]
    },
    {
        "tags": [
            "术师干员",
            "治疗"
        ],
        "operators": [
            "夜魔"
        ]
    },
    {
        "tags": [
            "支援",
            "费用回复"
        ],
        "operators": [
            "凛冬"
        ]
    },
    {
        "tags": [
            "削弱",
            "快速复活"
        ],
        "operators": [
            "槐琥"
        ]
    },
    {
        "tags": [
            "减速",
            "位移"
        ],
        "operators": [
            "食铁兽"
        ]
    },
    {
        "tags": [
            "先锋干员",
            "支援"
        ],
        "operators": [
            "凛冬"
        ]
    },
    {
        "tags": [
            "术师干员",
            "输出",
            "减速"
        ],
        "operators": [
            "夜魔"
        ]
    }
]

const tags4:Tags = [
    {
        "tags": [
            "削弱"
        ],
        "operators": [
            "初雪",
            "慑砂",
            "槐琥",
            "夜烟",
            "流星",
            "巫恋",
            "陨星"
        ]
    },
    {
        "tags": [
            "支援"
        ],
        "operators": [
            "清流",
            "杜宾",
            "华法琳",
            "诗怀雅",
            "白面鸮",
            "凛冬"
        ]
    },
    {
        "tags": [
            "快速复活"
        ],
        "operators": [
            "槐琥",
            "红",
            "砾"
        ]
    },
    {
        "tags": [
            "特种干员"
        ],
        "operators": [
            "阿消",
            "狮蝎",
            "崖心",
            "红",
            "砾",
            "槐琥",
            "暗索",
            "食铁兽"
        ]
    },
    {
        "tags": [
            "位移"
        ],
        "operators": [
            "可颂",
            "暗索",
            "阿消",
            "崖心",
            "食铁兽"
        ]
    },
    {
        "tags": [
            "爆发"
        ],
        "operators": [
            "守林人",
            "刻刀"
        ]
    },
    {
        "tags": [
            "近战位",
            "减速"
        ],
        "operators": [
            "霜叶",
            "食铁兽"
        ]
    },
    {
        "tags": [
            "术师干员",
            "减速"
        ],
        "operators": [
            "格雷伊",
            "夜魔"
        ]
    },
    {
        "tags": [
            "远程位",
            "输出",
            "减速"
        ],
        "operators": [
            "真理",
            "安比尔",
            "夜魔",
            "梅"
        ]
    },
    {
        "tags": [
            "输出",
            "减速"
        ],
        "operators": [
            "真理",
            "夜魔",
            "霜叶",
            "安比尔",
            "梅"
        ]
    },
    {
        "tags": [
            "远程位",
            "生存"
        ],
        "operators": [
            "杰西卡"
        ]
    },
    {
        "tags": [
            "近卫干员",
            "减速"
        ],
        "operators": [
            "霜叶"
        ]
    },
    {
        "tags": [
            "群攻",
            "减速"
        ],
        "operators": [
            "格雷伊",
            "白雪"
        ]
    },
    {
        "tags": [
            "狙击干员",
            "生存"
        ],
        "operators": [
            "杰西卡"
        ]
    },
    {
        "tags": [
            "狙击干员",
            "减速"
        ],
        "operators": [
            "白雪",
            "安比尔",
            "梅"
        ]
    },
    {
        "tags": [
            "治疗",
            "费用回复"
        ],
        "operators": [
            "桃金娘"
        ]
    },
    {
        "tags": [
            "先锋干员",
            "治疗"
        ],
        "operators": [
            "桃金娘"
        ]
    }
]

export {
    tags6,
    tags5,
    tags4,
    tag,
}